
{
  "id": 1,
  "name": "GTFS Fare Rules",
  "std_schema": "schema-gtfs_fare_rules",
  "desc": "Rules for applying fare information for a transit organization's routes.",
  "ver": "1.0",
  "cat": ["mobilita", "trasporto pubblico", "gtfs", "fare"],
  "tag": ["fare", "mobilita", "trasporti", "trasporti pubblici", "aziende trasporti", "dataset vip", "gtfs"],
  "owner": "daf",
  "src": {
    "type": "csv",
    "url": "urlVal",
    "table": "TableVal"
  },
  "info": {
    "url": "https://developers.google.com/transit/gtfs/reference/"
  },
  "fields": [
    {
      "name": "fare_id",
      "format": "string",
      "desc": "Contains an ID that uniquely identifies a route. The route_id is dataset unique.",
      "cat": "anagrafica",
      "required": 1
    },
    {
      "name": "route_id",
      "format": "string",
      "desc": "Associates the fare ID with a route. Route IDs are referenced from the routes.txt file. If you have several routes with the same fare attributes, create a row in fare_rules.txt for each route. For example, if fare class 'b' is valid on route 'TSW' and 'TSE', the fare_rules.txt file would contain these rows for the fare class: b,TSW b,TSE",
      "cat": "route",
      "required": 0
    },
    {
      "name": "origin_id",
      "format": "string",
      "desc": "Associates the fare ID with an origin zone ID (referenced from the stops.txt file). If you have several origin IDs with the same fare attributes, create a row in fare_rules.txt for each origin ID. For example, if fare class 'b' is valid for all travel originating from either zone '2' or zone '8', the fare_rules.txt file would contain these rows for the fare class: b, , 2 b, , 8",
      "cat": "fare",
      "required": 0
    },
    {
      "name": "destination_id",
      "format": "string",
      "desc": "Associates the fare ID with a destination zone ID (referenced from the stops.txt file). If you have several destination IDs with the same fare attributes, create a row in fare_rules.txt for each destination ID. For example, you could use the origin_ID and destination_ID fields together to specify that fare class 'b' is valid for travel between zones 3 and 4, and for travel between zones 3 and 5, the fare_rules.txt file would contain these rows for the fare class: b, , 3,4  b, 3,5",
      "cat": "route",
      "required": 0
    },
    {
      "name": "route_desc",
      "format": "string",
      "desc": "Contains a description of a route. Please provide useful, quality information. Do not simply duplicate the name of the route. For example, 'A trains operate between Inwood-207 St, Manhattan and Far Rockaway-Mott Avenue, Queens at all times. Also from about 6AM until about midnight, additional A trains operate between Inwood-207 St and Lefferts Boulevard (trains typically alternate between Lefferts Blvd and Far Rockaway).'",
      "cat": "route",
      "required": 0
    },
    {
      "name": "contains_id",
      "format": "string",
      "desc": "Associates the fare ID with a zone ID (referenced from the stops.txt file. The fare ID is then associated with itineraries that pass through every contains_id zone. For example, if fare class 'c' is associated with all travel on the GRT route that passes through zones 5, 6, and 7 the fare_rules.txt would contain these rows: c,GRT,,,5 c,GRT,,,6 c,GRT,,,7 Because all contains_id zones must be matched for the fare to apply, an itinerary that passes through zones 5 and 6 but not zone 7 would not have fare class 'c'. For more detail, see FareExamples in the GoogleTransitDataFeed project wiki.",
      "cat": "fare",
      "required": 0
    },
  ]
}
